Tekla Open API Reference for Tekla Structures 2025
EdgeChamferAttributes Constructor
Overload List
Name | Description
EdgeChamfer.EdgeChamferAttributes()
 Creates a new default edge chamfer attributes instance that loads standard attributes.
EdgeChamfer.EdgeChamferAttributes(String)
 Creates a new edge chamfer attributes instance that loads the specified attributes.
Top
See Also
Reference
EdgeChamfer.EdgeChamferAttributes Class
Tekla.Structures.Drawing Namespace